Revit 2027 API
BuiltInFailures.StairRampFailures.StairsAreUpdatedDueToLevelHeightChange Property
 Stair component(s) in the multistory stair are updated due to the level height changes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsAreUpdatedDueToLevelHeightChange { get; }
Public Shared ReadOnly Property StairsAreUpdatedDueToLevelHeightChange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsAreUpdatedDueToLevelHeightChange {
	FailureDefinitionId^ get ();
}
static member StairsAreUpdatedDueToLevelHeightChange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace